{
  "blogs": [
    {
      "title": "TechIndia",
      "body": "This article is about the use and knowledge of techniques and processes for producing goods and services. For other uses, see Technology (disambiguation).\n\nA steam turbine with the case opened. Such turbines produce most of the electricity used today. Electricity consumption and living standards are highly correlated.[1]\nTechnology (\"science of craft\", from Greek τέχνη, techne, \"art, skill, cunning of hand\"; and -λογία, -logia[2]) is the sum of any techniques, skills, methods, and processes used in the production of goods or services or in the accomplishment of objectives, such as scientific investigation. Technology can be the knowledge of techniques, processes, and the like, or it can be embedded in machines to allow for operation without detailed knowledge of their workings. Systems (e.g. machines) applying technology by taking an input, changing it according to the system's use, and then producing an outcome are referred to as technology systems or technological systems.\n\nThe simplest form of technology is the development and use of basic tools. The prehistoric invention of shaped stone tools followed by the discovery of how to control fire increased sources of food. The later Neolithic Revolution extended this, and quadrupled the sustenance available from a territory. The invention of the wheel helped humans to travel in and control their environment.\n\nDevelopments in historic times, including the printing press, the telephone, and the Internet, have lessened physical barriers to communication and allowed humans to interact freely on a global scale.\n\nTechnology has many effects. It has helped develop more advanced economies (including today's global economy) and has allowed the rise of a leisure class. Many technological processes produce unwanted by-products known as pollution and deplete natural resources to the detriment of Earth's environment. Innovations have always influenced the values of a society and raised new questions in the ethics of technology. Examples include the rise of the notion of efficiency in terms of human productivity, and the challenges of bioethics.\n\nPhilosophical debates have arisen over the use of technology, with disagreements over whether technology improves the human condition or worsens it. Neo-Luddism, anarcho-primitivism, and similar reactionary movements criticize the pervasiveness of technology, arguing that it harms the environment and alienates people; proponents of ideologies such as transhumanism and techno-progressivism view continued technological progress as beneficial to society and the human condition.\n\n\nContents\n1\tDefinition and usage\n2\tScience, engineering, and technology\n3\tHistory\n3.1\tPaleolithic (2.5 Ma – 10 ka)\n3.1.1\tStone tools\n3.1.2\tFire\n3.1.3\tClothing and shelter\n3.2\tNeolithic through classical antiquity (10 ka – 300 CE)\n3.2.1\tMetal tools\n3.2.2\tEnergy and transport\n3.2.3\tPlumbing\n3.3\tMedieval and modern history (300 CE – present)\n4\tPhilosophy\n4.1\tTechnicism\n4.2\tOptimism\n4.3\tSkepticism and critics\n4.4\tAppropriate technology\n4.5\tOptimism and skepticism in the 21st century\n4.6\tComplex technological systems\n5\tOther animal species\n6\tFuture technology\n7\tSee also\n8\tReferences\n9\tFurther reading\nDefinition and usage\n\nThe spread of paper and printing to the West, as in this printing press, helped scientists and politicians communicate their ideas easily, leading to the Age of Enlightenment; an example of technology as cultural force.\nThe use of the term \"technology\" has changed significantly over the last 200 years. Before the 20th century, the term was uncommon in English, and it was used either to refer to the description or study of the useful arts[3] or to allude to technical education, as in the Massachusetts Institute of Technology (chartered in 1861).[4]\n\nThe term \"technology\" rose to prominence in the 20th century in connection with the Second Industrial Revolution. The term's meanings changed in the early 20th century when American social scientists, beginning with Thorstein Veblen, translated ideas from the German concept of Technik into \"technology.\" In German and other European languages, a distinction exists between technik and technologie that is absent in English, which usually translates both terms as \"technology.\" By the 1930s, \"technology\" referred not only to the study of the industrial arts but to the industrial arts the",
      "author": "Manish",
      "id": 1
    }
  ]
}